# Дано предложение. Найти количество сочетаний букв "IQ" в предложении.

string = input("Введите предложение на аглискоом:\n")
print(string.count("IQ"))